Tekla.Structures.Internal.PluginHelper


Tekla.Structures.Internal.PluginHelper.StructuresPlugin


Tekla.Structures.Internal.PluginHelper.Invoker


Tekla.Structures.Internal.PluginHelper.InputThread


Tekla.Structures.Internal.PluginHelper.GetCorrectInstance(Tekla.Structures.Internal.StructuresPluginDescriptor)


Tekla.Structures.Internal.PluginHelper.CreateInputThread(System.Boolean)


Tekla.Structures.Internal.PluginHelper.StartInputThread(System.Boolean)


Tekla.Structures.Internal.PluginHelper.GetInvoker


Tekla.Structures.Internal.PluginHelper.Finish


Tekla.Structures.Internal.PluginHelper.Cancel


Tekla.Structures.Internal.PluginHelper.BeginInvoke(System.Delegate,System.Object[])
DO NOT USE! For internal usage only!
method:
args:
Returns:

Tekla.Structures.Internal.PluginHelper.EndInvoke(Tekla.Structures.Internal.dotPluginInput_t@,System.IAsyncResult)
DO NOT USE! For internal usage only!
pInput:
result:
Returns:

Tekla.Structures.Internal.PluginHelper.EndInvoke(Tekla.Structures.Internal.dotPluginDefinition_t@,System.IAsyncResult)
DO NOT USE! For internal usage only!
pDefinition:
result:
Returns:

Tekla.Structures.Internal.PluginHelper.EndInvoke(Tekla.Structures.Internal.dotPluginClient_t@,System.IAsyncResult)


Tekla.Structures.Internal.PluginHelper.AddPlugin(Tekla.Structures.Internal.StructuresPluginDescriptor)
DO NOT USE! For internal usage only!
structuresPlugin:
Returns:

Tekla.Structures.Internal.PluginHelper.SetCurrentPlugin(Tekla.Structures.Internal.ITsInvoker,System.Object)
DO NOT USE! For internal usage only!
Invoker:
currentPlugin:
Returns:

Tekla.Structures.Internal.PluginHelper.GetCurrentPlugin
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.Internal.PluginHelper.DefineInput
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.PluginHelper.Run
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.Internal.PluginHelper.GetInputFromCore
DO NOT USE! For internal usage only!
Returns: